; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 446000 1 3 2 7 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph1 - mode
	image0 - mode
	Star2 - direction
	Star3 - direction
	Star6 - direction
	GroundStation0 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 spectrograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
)
(:goal (and
	(pointing satellite0 Planet12)
	(have_image Phenomenon7 spectrograph1)
	(have_image Star8 image0)
	(have_image Star9 image0)
	(have_image Star10 image0)
	(have_image Phenomenon11 spectrograph1)
	(have_image Planet12 image0)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 7
2. (turn_to satellite0 groundstation1 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 7
3. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 7
4. (turn_to satellite0 star9 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star9)
   goals met: 0 of 7
5. (take_image satellite0 star9 instrument2 image0)
   added: (have_image star9 image0)
   goals met: 1 of 7
6. (turn_to satellite0 star10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star10)
   goals met: 1 of 7
7. (take_image satellite0 star10 instrument2 image0)
   added: (have_image star10 image0)
   goals met: 2 of 7
8. (turn_to satellite0 planet12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet12)
   goals met: 3 of 7
9. (take_image satellite0 planet12 instrument2 image0)
   added: (have_image planet12 image0)
   goals met: 4 of 7
10. (turn_to satellite0 phenomenon7 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 7
11. (take_image satellite0 phenomenon7 instrument2 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   goals met: 4 of 7
12. (turn_to satellite0 planet12 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet12)
   goals met: 5 of 7
13. (turn_to satellite0 phenomenon11 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 7
14. (take_image satellite0 phenomenon11 instrument2 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 5 of 7
15. (turn_to satellite0 planet12 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet12)
   goals met: 6 of 7
16. (turn_to satellite0 star8 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star8)
   goals met: 5 of 7
17. (take_image satellite0 star8 instrument2 image0)
   added: (have_image star8 image0)
   goals met: 6 of 7
18. (turn_to satellite0 planet12 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet12)
   goals met: 7 of 7
